OdRxValueIterator.current
\details
Returns the current item.

OdRxValueIterator.next
\details
Step to the next item. Returns true if there actually was a next item.

OdRxValueIterator.done
\details
Returns true if the iteration is ended.